# Taps
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"

# Non-nixpkgs tools
brew "azure-cli"
brew "mas"
brew "parquet-tool"

# GUI apps from Hombrew
cask "1password6"
cask "discord"
cask "docker"
cask "intune-company-portal"
cask "microsoft-azure-storage-explorer"
cask "microsoft-azure-storage-explorer"
cask "microsoft-office"
cask "microsoft-teams"
cask "firefox"
cask "google-chrome"
cask "iina"
cask "iterm2"
cask "menumeters"
cask "keybase"
cask "qbitorrent"
cask "private-internet-access"
cask "slack"
cask "visual-studio-code"

# GUI apps from Mac App Store
mas "Xcode",                id: 497799835
